/*動的計画法に基づく最長共通部分の探索*/

/*
与えられた二つの文字列、X,Yに対して、最長共通部分列Zの長さを出力するプログラムを作成

入力：
    １＞最初にデータセットの数qが与えられる。
    2*q＞複数の文字列X,Yがそれぞれ一行に与えられる。

出力：
    １＞各データセットについて、X、Yの最長共通部分列の長さを１行に出力
    ２＞
*/

////////////////////////////// 前処理 //////////////////////////////////////

#include<stdio.h>
#define N 1000

////////////////////////////// lcs //////////////////////////////////////
 int lcs(char X,char Y){
     int c[N+1][N+1];   //動的計画法のリスト
     int m =X.size;     //文字列の大きさ
     int n =Y.size;     //文字列の大きさ
     int maxl = 0;      //最長の長さ
     X = " " + X;       //X[0]に空白を入力
     Y = " " + Y;       //Y[0]に空白を入力
     for(int i = 1; i <= m; i++)c[i][0] = 0;
     for(int j = 1; i <= n; j++)c[0][j] = 0; //初期化

     for(int i = 0; i<=m; i++){
         for(int j = 0; j<=n; j++){
             if(X[i] == Y[j]){c[i][j] = c[i-1][j-1]+1;}
             else{c[i][j] = max(c[i-1][j],c[i][j-1]]);}
         }
         maxl = max(maxl,c[i][j]) //入れ替え
     }

 }

 ////////////////////////////// メイン関数 //////////////////////////////////////
 int main(){
     int n;
     char* s1,s2;
     scanf("%d",&n);
     for(int i = 0;i < n; i++){
         scanf("%d",s1);
         scanf("%d",s2);
         printf("%d",lcs(s1,s2));
     }
     return 0;
 } 

 ////////////////////////////// メイン関数 //////////////////////////////////////
 
 //計算量 O(mn)
 